[
    {
        "id": "space",
        "title": "Space Tourism",
        "icon": "/icons/planet.png",
        "presentation": "Réalisation d'un challenge de la plateforme Frontend Mentor.",
        "description": "Réalisation d'un challenge de la plateforme Frontend Mentor.",
        "objectif": "Projet me permettant de continuer à perfectionner mes compétences sur React, de découvrir et de prendre en main Framer-motion. Une bonne architecture de dossiers est de mise, plusieurs fonctionnalités à mettre en place comme la navigation animée entre les différentes pages avec react-router et framer-motion, ainsi que plusieurs carrousel pour présenter les parties du site.",
        "techno": [
            "React",
            "Framer-motion",
            "SASS",
            "Responsive Web Design",
            "Figma"
        ],
        "repo": "https://github.com/AlexDDevv/space-tourism",
        "website": "https://space-tourism-star.vercel.app/",
        "cover": "/bgBento/bgBentoSpace.webp",
        "images": [
            "/carrouselImg/space/space1.webp",
            "/carrouselImg/space/space2.webp",
            "/carrouselImg/space/space3.webp",
            "/carrouselImg/space/space4.webp"
        ]
    },
    {
        "id": "library",
        "title": "My little Library",
        "icon": "/icons/book.png",
        "presentation": "Bibliothèque numérique permettant de chercher des livres, d'enregistrer ceux que l'on a déjà lu ou que l'on souhaite lire.",
        "description": "Petite bibliothèque numérique pour enregistrer des livres à lire ou déjà lus.",
        "objectif": "Aimant beaucoup lire, j'ai souhaité créer un projet autour de la lecture, qui pourrait me servir à garder une trace de tous les livres que j'ai lu ou d'avoir une liste de ceux que j'aimerais lire. J'ai mis à contribution les compétences que j'ai acquises durant ma formation, notamment React. J'ai utilisé l'API Google Books pour récupérer les données. Ce projet m'a aussi permis de travailler ma créativité, ayant fait le design moi-même. Plusieurs fonctionnalités seront rajoutées dans le futur.",
        "techno": [
            "React",
            "SASS",
            "Google API",
            "Responsive Web Design",
            "Design"
        ],
        "repo": "https://github.com/AlexDDevv/My-library",
        "website": "https://my-little-library.vercel.app/",
        "cover": "/bgBento/bgBentoLibrary.webp",
        "images": [
            "/carrouselImg/library/library1.webp",
            "/carrouselImg/library/library2.webp",
            "/carrouselImg/library/library3.webp",
            "/carrouselImg/library/library4.webp",
            "/carrouselImg/library/library5.webp",
            "/carrouselImg/library/library6.webp"
        ]
    },
    {
        "id": "portfolio",
        "title": "Ancien portfolio",
        "icon": "/icons/resume.png",
        "presentation": "Projet formation OpenClassrooms: conception de mon portfolio.",
        "description": "Conception de mon portfolio pour mettre en avant mon travail.",
        "objectif": "Pour ce projet, je devais réaliser un portfolio pour mettre en avant mon travail et mes réalisations auprès des recruteurs. Le choix des technologies était libre, mais il fallait respecter certaines conditions pour valider le projet: présenter son profil avec la ou les formations suivies et ses compétences, présenter au moins deux projets avec une courte description, les compétences utilisées et un lien vers le repository ou le site, être accessible en ligne et être responsive.",
        "techno": [
            "React",
            "SASS",
            "Animation CSS",
            "Responsive Web Design",
            "Design"
        ],
        "repo": "https://github.com/AlexDDevv/Portfolio-v2",
        "website": "https://alexis-delporte.com/",
        "cover": "/bgBento/bgBentoPortfolio.webp",
        "images": [
            "/carrouselImg/portfolio/portfolio1.webp",
            "/carrouselImg/portfolio/portfolio2.webp",
            "/carrouselImg/portfolio/portfolio3.webp"
        ]
    },
    {
        "id": "bank",
        "title": "Argent Bank",
        "icon": "/icons/bank.png",
        "presentation": "Projet formation OpenClassrooms: implémenter le front-end d'une application bancaire avec React.",
        "description": "Transformer un site web existant en un site web performant et dynamique avec React/Redux.",
        "objectif": "Pour ce projet, je devais utiliser les pages HTML et le code CSS que l'on m'a fourni pour transformer le tout en composants React réutilisables et optimiser les images pour améliorer les performances de l'appliaction afin de favoriser les bonnes pratiques de développement (Green Code). Je devais aussi m'occuper de la mise en place de Redux pour gérer les différentes données, notamment l'authentification de l'utilisateur avec JWT (Json Web Tokens) et Axios pour des appels API sécurisés, permettre aux utilisateurs de récupérer leurs informations en se connectant et de pouvoir en modifier si ils le souhaitent. Je devais aussi créer les routes pour les transactions dans l'éditeur de Swagger, ce qui impliquait de choisir les méthodes HTTP appropriées, telles que GET, PUT ou DELETE, pour simplifier leur gestion future.",
        "techno": [
            "React",
            "Redux",
            "MongoDB",
            "Swagger",
            "Axios",
            "JWT"
        ],
        "repo": "https://github.com/AlexDDevv/ArgentBank",
        "cover": "/bgBento/bgBentoBank.webp",
        "images": [
            "/carrouselImg/bank/bank1.webp",
            "/carrouselImg/bank/bank2.webp",
            "/carrouselImg/bank/bank3.webp",
            "/carrouselImg/bank/bank4.webp"
        ]
    },
    {
        "id": "debug",
        "title": "724events",
        "icon": "/icons/bug.png",
        "presentation": "Projet formation OpenClassrooms: débugger le site d'une agence d'événementiel.",
        "description": "Débuggage complet d'une refonte de site vitrine.",
        "objectif": "Pour ce projet, je devais effectuer un débuggage complet et optimiser le site web de 724events. J'ai commencé par une analyse approfondie du code source existant, en identifiant les problèmes techniques qui entravaient les performances du site. Mon objectif était de garantir que le site soit fluide et réactif pour les visiteurs. J'ai utilisé des tests unitaires pour vérifier chaque composant du site. Les React Dev Tools ont été essentiels pour analyser et optimiser le code. Grâce à ces outils, j'ai pu cibler les zones spécifiques nécessitant des améliorations. En parallèle, j'ai finalisé le cahier de recette, créant des scénarios détaillés pour vérifier que chaque fonctionnalité du site fonctionnait comme prévu. Cela incluait des tests de navigation, de formulaire, de performance, et bien d'autres.",
        "techno": [
            "Débuggage",
            "Optimisation",
            "Tests Unitaires",
            "React Dev Tools"
        ],
        "repo": "https://github.com/AlexDDevv/P10-debugguer-724Events",
        "cover": "/bgBento/bgBentoBug.webp",
        "images": [
            "/carrouselImg/bug/bug1.webp"
        ]
    },
    {
        "id": "nina",
        "title": "Nina Carducci",
        "icon": "/icons/photographer.png",
        "presentation": "Projet formation OpenClassrooms: optimiser le référencement d'un site de photographe.",
        "description": "Optimisation du site d'une photographe professionnelle.",
        "objectif": "Pour ce projet, je devais améliorer la performance globale du site, en réduisant le temps de chargement et en renforçant son référencement sur les moteurs de recherche. Optimisation des images, refonte du code et de la structure du site, mise en place du référencement local avec Schema.org et ajout des métas pour les réseaux sociaux. J'ai aussi réalisé une optimisation SEO du site grâce à une analyse avec Lighthouse, intégré le Rich Snippet pour une meilleure visibilité sur les moteurs de recherche et effectué une analyse approfondie avec Wave pour garantir une bonne accessiblité du site pour tous. Grâce à cex améliorations, l'expérience utilisateur est plus fluide, Nina a une meilleure visibilité en ligne et attire de nouveaux clients.",
        "techno": [
            "Optimisation",
            "SEO",
            "Accessibilité",
            "Référencement local",
            "Rich Snippet"
        ],
        "repo": "https://github.com/AlexDDevv/P9-Optimisation-Nina-Carducci",
        "website": "https://alexddevv.github.io/P9-Optimisation-Nina-Carducci/",
        "cover": "/bgBento/bgBentoNina.webp",
        "images": [
            "/carrouselImg/nina/nina1.webp"
        ]
    },
    {
        "id": "kasa",
        "title": "Kasa",
        "icon": "/icons/agence.png",
        "presentation": "Projet formation OpenClassrooms: créer une application web de location immobilière avec React.",
        "description": "Refonte du site Kasa avec une stack JS plus récente.",
        "objectif": "Pour ce projet, je devais développer l'ensemble de l'application en modernisant la plateforme avec une stack complète en JS plus récente, afin d'offrir une meilleure expérience utilisateur sur différentes tailles d'écrans, tout en restant le plus fidèle possible aux maquettes fournies. Pour ce faire, j'ai introduis des éléments avancés, comme un carrousel pour afficher les images des logements, l'implémentation d'un collapse pour améliorer l'UX et la gestion dynamique des fiches logements à partir de données internes.",
        "techno": [
            "React",
            "SASS",
            "Responsive Web Design",
            "Figma"
        ],
        "repo": "https://github.com/AlexDDevv/P8-Kasa",
        "website": "https://p8-kasa-sigma.vercel.app/",
        "cover": "/bgBento/bgBentoKasa.webp",
        "images": [
            "/carrouselImg/kasa/kasa1.webp",
            "/carrouselImg/kasa/kasa2.webp",
            "/carrouselImg/kasa/kasa3.webp"
        ]
    },
    {
        "id": "bluel",
        "title": "Sophie Bluel",
        "icon": "/icons/house.png",
        "presentation": "Projet formation OpenClassrooms: conception du site portfolio d'une architecte d'intérieur.",
        "description": "Conception du site portfolio d'une architecte d'intérieur.",
        "objectif": "Pour ce projet, je devais développer plusieurs fonctionnalités importantes du site. Je devais notamment créer la page de présentation des travaux de l'architecte avec un système de filtre par catégories, la page de connexion sécurisée de l'administrateur et une fenêtre modale pour ajouter et/ou supprimer un projet dans la galerie de présentation. Le tout a été généré dynamiquement avec Javascript et en communiquant avec une API.",
        "techno": [
            "HTML5",
            "CSS3",
            "JS",
            "Node.js",
            "Swagger",
            "Figma"
        ],
        "repo": "https://github.com/AlexDDevv/P6-Portefolio-Sophie-Bluel",
        "cover": "/bgBento/bgBentoBluel.webp",
        "images": [
            "/carrouselImg/bluel/bluel1.webp",
            "/carrouselImg/bluel/bluel2.webp",
            "/carrouselImg/bluel/bluel3.webp",
            "/carrouselImg/bluel/bluel4.webp",
            "/carrouselImg/bluel/bluel5.webp",
            "/carrouselImg/bluel/bluel6.webp"
        ]
    },
    {
        "id": "food",
        "title": "OhMyFood",
        "icon": "/icons/menu.png",
        "presentation": "Projet formation OpenClassrooms: améliorer l'interface d'un site mobile avec des animations CSS.",
        "description": "Site web répertoriant les menus de restaurants gastronomiques.",
        "objectif": "Pour ce projet, je devais créer le site d'une start-up en mobile first, pour prioriser l'optimisation de l'expérience utilisateur sur les appareils mobiles, garantissant une expérience fluide et réactive quel que soit l'appareil qu'ils utilisent. J'ai intégré des animations fluides et naturelles pour améliorer l'intéractivité du site, offrant ainsi une expérience utilisateur agréable.",
        "techno": [
            "HTML5",
            "SASS",
            "Animations CSS",
            "Responsive Web Design"
        ],
        "repo": "https://github.com/AlexDDevv/P4-OhMyFood",
        "website": "https://p4-oh-my-food.vercel.app/",
        "cover": "/bgBento/bgBentoFood.webp",
        "images": [
            "/carrouselImg/food/food1.webp",
            "/carrouselImg/food/food2.webp",
            "/carrouselImg/food/food3.webp"
        ]
    }
]